; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v13 ?v12)
             (pred_7 ?v4 ?v2)
             (pred_4 ?v13 ?v2)
             (pred_11 ?v6 ?v13 )
	     (pred_2 ?v13)
             (pred_9 ?v9)
             (pred_12 ?v4)
             (pred_8 ?v2)
             (pred_10 ?v13)
             (pred_3 ?v4)
             (pred_1 ?v13)
             (pred_5 ))



(:action op_2
:parameters (?v11 ?v1 ?v10 ?v7)
:precondition (and (pred_9 ?v11) (pred_9 ?v1) (pred_12 ?v10) (pred_8 ?v7)
          (pred_6 ?v11 ?v1) (pred_7 ?v10 ?v7)
                   (pred_4 ?v1 ?v7) (pred_2 ?v11) 
                   (pred_10 ?v1) (pred_3 ?v10))
:effect (and  (pred_1 ?v1) (not (pred_10 ?v1))))


(:action op_4
:parameters (?v11 ?v3)
:precondition (and (pred_9 ?v11) (pred_9 ?v3)
               (pred_2 ?v11) (pred_6 ?v11 ?v3) (pred_1 ?v3))
:effect (and (pred_2 ?v3) (not (pred_2 ?v11))))

(:action op_3
:parameters (?v11 ?v10)
:precondition (and (pred_9 ?v11) (pred_12 ?v10) 
                  (pred_2 ?v11) (pred_11 ?v10 ?v11) (pred_5 ))
:effect (and (pred_3 ?v10)
   (not (pred_11 ?v10 ?v11)) (not (pred_5 ))))


(:action op_5
:parameters (?v11 ?v5 ?v8)
:precondition (and (pred_9 ?v11) (pred_12 ?v5) (pred_12 ?v8)
                  (pred_2 ?v11) (pred_3 ?v8) (pred_11 ?v5 ?v11))
:effect (and (pred_3 ?v5) (pred_11 ?v8 ?v11)
        (not (pred_3 ?v8)) (not (pred_11 ?v5 ?v11))))

(:action op_1
:parameters (?v11 ?v10)
:precondition (and (pred_9 ?v11) (pred_12 ?v10) 
                  (pred_2 ?v11) (pred_3 ?v10))
:effect (and (pred_5 ) (pred_11 ?v10 ?v11) (not (pred_3 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_15 obj_12 obj_20 obj_02 obj_19 obj_13 obj_05 obj_08 obj_16 obj_06 obj_04 obj_18 obj_10 obj_21 obj_17
    obj_03 obj_11 obj_01
    obj_22 obj_14 obj_09
    )

    (:init
       (pred_5)

       (pred_9 obj_07)
       (pred_9 obj_15)
       (pred_9 obj_12)
       (pred_9 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_19)
       (pred_9 obj_13)
       (pred_9 obj_05)
       (pred_9 obj_08)
       (pred_9 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_04)
       (pred_9 obj_18)
       (pred_9 obj_10)
       (pred_9 obj_21)
       (pred_9 obj_17)
       (pred_8 obj_03)
       (pred_8 obj_11)
       (pred_8 obj_01)
       (pred_12 obj_22)
       (pred_12 obj_14)
       (pred_12 obj_09)

       (pred_6 obj_07 obj_02)
       (pred_6 obj_07 obj_15)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_12)
       (pred_6 obj_15 obj_07)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_12 obj_15)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_02 obj_19)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_19 obj_13)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_19 obj_02)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_05)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_19)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_05 obj_13)
       (pred_6 obj_08 obj_18)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_06 obj_21)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_04 obj_17)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_10 obj_21)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_21 obj_17)
       (pred_6 obj_21 obj_06)
       (pred_6 obj_21 obj_10)
       (pred_6 obj_17 obj_04)
       (pred_6 obj_17 obj_21)
       (pred_10 obj_06)
       (pred_10 obj_13)
       (pred_10 obj_08)
       (pred_4  obj_06 obj_03)
       (pred_4  obj_13 obj_11)
       (pred_4  obj_08 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_15)
       (pred_1 obj_12)
       (pred_1 obj_20)
       (pred_1 obj_02)
       (pred_1 obj_19)
       (pred_1 obj_05)
       (pred_1 obj_16)
       (pred_1 obj_04)
       (pred_1 obj_18)
       (pred_1 obj_10)
       (pred_1 obj_21)
       (pred_1 obj_17)

       (pred_7  obj_22 obj_03)
       (pred_7  obj_14 obj_11)
       (pred_7  obj_09 obj_01)
       (pred_11 obj_22 obj_05)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_09 obj_20)
       (pred_2 obj_10)
    )

    (:goal (and
       (pred_11 obj_22 obj_19)
    ))
(:constraints
  (always (not (pred_2 obj_13)))
)
)

; plan
1. (op_4 obj_10 obj_16)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_16)
   goals met: 0 of 1
2. (op_3 obj_16 obj_14)
   deleted: (pred_11 obj_14 obj_16) (pred_5)
   added: (pred_3 obj_14)
   goals met: 0 of 1
3. (op_4 obj_16 obj_19)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_19)
   goals met: 0 of 1
4. (op_2 obj_19 obj_13 obj_14 obj_11)
   deleted: (pred_10 obj_13)
   added: (pred_1 obj_13)
   goals met: 0 of 1
5. (op_1 obj_19 obj_14)
   deleted: (pred_3 obj_14)
   added: (pred_5) (pred_11 obj_14 obj_19)
   goals met: 0 of 1
6. (op_4 obj_19 obj_15)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_15)
   goals met: 0 of 1
7. (op_4 obj_15 obj_12)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_12)
   goals met: 0 of 1
8. (op_4 obj_12 obj_20)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_20)
   goals met: 0 of 1
9. (op_4 obj_20 obj_05)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_05)
   goals met: 0 of 1
10. (op_3 obj_05 obj_22)
   deleted: (pred_11 obj_22 obj_05) (pred_5)
   added: (pred_3 obj_22)
   goals met: 0 of 1
11. (op_4 obj_05 obj_20)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_20)
   goals met: 0 of 1
12. (op_4 obj_20 obj_12)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_12)
   goals met: 0 of 1
13. (op_4 obj_12 obj_15)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_15)
   goals met: 0 of 1
14. (op_4 obj_15 obj_19)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_19)
   goals met: 0 of 1
15. (op_5 obj_19 obj_14 obj_22)
   deleted: (pred_3 obj_22) (pred_11 obj_14 obj_19)
   added: (pred_3 obj_14) (pred_11 obj_22 obj_19)
   goals met: 1 of 1
